# 12.1 JSON 파일 읽고 쓰기

# 12.1.1. JSON 파일을 DataFrame으로 불러오기

In [1]:
import pandas as pd

In [3]:
nobel = pd.read_json('nobel.json')
nobel.head()

                                              prizes
0  {'year': '2019', 'category': 'chemistry', 'lau...
1  {'year': '2019', 'category': 'economics', 'lau...
2  {'year': '2019', 'category': 'literature', 'la...
3  {'year': '2019', 'category': 'peace', 'laureat...
4  {'year': '2019', 'category': 'physics', 'overa...

In [4]:
nobel.loc[2, 'prizes']

{'year': '2019',
 'category': 'literature',
 'laureates': [{'id': '980',
   'firstname': 'Peter',
   'surname': 'Handke',
   'motivation': '"for an influential work that with linguistic ingenuity has explored the periphery and the specificity of human experience"',
   'share': '1'}]}

In [5]:
type(nobel.loc[2, 'prizes'])

dict

In [7]:
chemistry_2019 = nobel.loc[0, 'prizes']
chemistry_2019

{'year': '2019',
 'category': 'chemistry',
 'laureates': [{'id': '976',
   'firstname': 'John',
   'surname': 'Goodenough',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '977',
   'firstname': 'M. Stanley',
   'surname': 'Whittingham',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '978',
   'firstname': 'Akira',
   'surname': 'Yoshino',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'}]}

In [8]:
pd.json_normalize(data = chemistry_2019)

   year   category                                          laureates
0  2019  chemistry  [{'id': '976', 'firstname': 'John', 'surname':...

In [9]:
pd.json_normalize(data = chemistry_2019, record_path = 'laureates')

,id,firstname,surname,motivation,share
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3

In [10]:
pd.json_normalize(
    data = chemistry_2019,
    record_path = 'laureates',
    meta = ['year', 'category']
)

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry

In [11]:
pd.json_normalize(
    data = nobel['prizes'],
    record_path = 'laureates',
    mata = ['year', 'category']
)

TypeError: _json_normalize() got an unexpected keyword argument 'mata'

In [12]:
cheese_consumption = {
    'France': 57.9,
    'Germany': 53.2,
    'Luxebourg': 53.2
}

In [13]:
cheese_consumption.setdefault('France', 100)

57.9

In [14]:
cheese_consumption['France']

57.9

In [15]:
cheese_consumption.setdefault('Italy', 48)

48

In [16]:
cheese_consumption

{'France': 57.9, 'Germany': 53.2, 'Luxebourg': 53.2, 'Italy': 48}

In [17]:
def add_laureates_key(entry):
    entry.setdefault('laureates', [])
    
nobel['prizes'].apply(add_laureates_key)

0      None
1      None
2      None
3      None
4      None
       ...
641    None
642    None
643    None
644    None
645    None
Name: prizes, Length: 646, dtype: object

In [18]:
winners = pd.json_normalize(
    data = nobel['prizes'],
    record_path = 'laureates',
    meta = ['year', 'category']
)
winners

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry
3,982,Abhijit,Banerjee,"""for their experimental approach to alleviatin...",3,2019,economics
4,983,Esther,Duflo,"""for their experimental approach to alleviatin...",3,2019,economics
...,...,...,...,...,...,...,...
945,569,Sully,Prudhomme,"""in special recognition of his poetic composit...",1,1901,literature
946,462,Henry,Dunant,"""for his humanitarian efforts to help wounded ...",2,1901,peace
947,463,Frédéric,Passy,"""for his lifelong work for international peace...",2,1901,peace
948,1,Wilhelm Conrad,Röntgen,"""in recognition of the extraordinary services ...",1,1901,physics
949,293,Emil,von Behring,"""for his work on serum therapy, especially its...",1,1901,medicine

## 12.1.2 DataFrame을 JSON 파일로 내보내기

In [19]:
winners.head(2)

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry

In [21]:
winners.head(2).to_json(orient = 'records')

'[{"id":"976","firstname":"John","surname":"Goodenough","motivation":"\\"for the development of lithium-ion batteries\\"","share":"3","year":"2019","category":"chemistry"},{"id":"977","firstname":"M. Stanley","surname":"Whittingham","motivation":"\\"for the development of lithium-ion batteries\\"","share":"3","year":"2019","category":"chemistry"}]'

In [22]:
winners.head(2).to_json(orient = 'split')

'{"columns":["id","firstname","surname","motivation","share","year","category"],"index":[0,1],"data":[["976","John","Goodenough","\\"for the development of lithium-ion batteries\\"","3","2019","chemistry"],["977","M. Stanley","Whittingham","\\"for the development of lithium-ion batteries\\"","3","2019","chemistry"]]}'

In [23]:
winners.to_json('winners.json', orient = 'records')

# 12.2 CSV 파일 읽고 쓰기

In [26]:
url = 'https://data.cityofnewyork.us/resource/25th-nujf.csv'
baby_names = pd.read_csv(url)
baby_names.head()

   brth_yr    gndr                      ethcty      nm  cnt  rnk
0     2019  FEMALE  ASIAN AND PACIFIC ISLANDER   Chloe  131    1
1     2019  FEMALE  ASIAN AND PACIFIC ISLANDER  Olivia  109    2
2     2019  FEMALE  ASIAN AND PACIFIC ISLANDER     Mia   88    3
3     2019  FEMALE  ASIAN AND PACIFIC ISLANDER  Sophia   71    4
4     2019  FEMALE  ASIAN AND PACIFIC ISLANDER    Emma   71    4

In [27]:
baby_names.head(10).to_csv()

',brth_yr,gndr,ethcty,nm,cnt,rnk\r\n0,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,131,1\r\n1,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,109,2\r\n2,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Mia,88,3\r\n3,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,71,4\r\n4,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Emma,71,4\r\n5,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Amelia,60,5\r\n6,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Charlotte,57,6\r\n7,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Emily,53,7\r\n8,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Grace,48,8\r\n9,2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Isabella,43,9\r\n'

In [29]:
baby_names.head(10).to_csv(index = False)

'brth_yr,gndr,ethcty,nm,cnt,rnk\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,131,1\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,109,2\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Mia,88,3\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,71,4\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Emma,71,4\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Amelia,60,5\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Charlotte,57,6\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Emily,53,7\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Grace,48,8\r\n2019,FEMALE,ASIAN AND PACIFIC ISLANDER,Isabella,43,9\r\n'

In [30]:
baby_names.to_csv('NYC_Baby_Names.csv', index = False)

In [31]:
baby_names.to_csv(
    'NYC_Baby_Names.csv',
    index = False,
    columns = ['gndr', 'nm', 'cnt']
)

# 12.3 엑셀 통합문서에 읽고 쓰기

## 12.3.1 아나콘다 환경에 xlrd와 openpyxl 라이브러리 설치

## 12.3.2 엑셀 통합문서 가져오기

In [32]:
pd.read_excel('Single Worksheet.xlsx')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [33]:
pd.read_excel(
    io = 'Single Worksheet.xlsx',
    usecols = ['City', 'First Name', 'Last Name'],
    index_col = 'City'
)

              First Name Last Name
City
Miami            Brandon     James
Denver              Sean   Hawkins
Los Angeles         Judy       Day
San Francisco     Ashley      Ruiz
Portland       Stephanie     Gomez

In [35]:
pd.read_excel('Multiple Worksheets.xlsx')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [36]:
# 다음 두 줄은 결과가 동일합니다.
pd.read_excel('Multiple Worksheets.xlsx', sheet_name = 0)
pd.read_excel('Multiple Worksheets.xlsx', sheet_name = 'Data 1')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [37]:
workbook = pd.read_excel(
    'Multiple Worksheets.xlsx', sheet_name = None
)

workbook

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

In [38]:
type(workbook)

dict

In [39]:
workbook['Data 2']

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [40]:
pd.read_excel(
    'Multiple Worksheets.xlsx',
    sheet_name = ['Data 1', 'Data 3']
)

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

In [41]:
pd.read_excel('Multiple Worksheets.xlsx', sheet_name = [1, 2])

{1:   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F,
 2:   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

## 12.3.3 엑셀 통합문서 내보내기

In [42]:
baby_names.head()

   brth_yr    gndr                      ethcty      nm  cnt  rnk
0     2019  FEMALE  ASIAN AND PACIFIC ISLANDER   Chloe  131    1
1     2019  FEMALE  ASIAN AND PACIFIC ISLANDER  Olivia  109    2
2     2019  FEMALE  ASIAN AND PACIFIC ISLANDER     Mia   88    3
3     2019  FEMALE  ASIAN AND PACIFIC ISLANDER  Sophia   71    4
4     2019  FEMALE  ASIAN AND PACIFIC ISLANDER    Emma   71    4

In [44]:
girls = baby_names[baby_names['gndr'] == 'FEMALE']
boys = baby_names[baby_names['gndr'] == 'MALE']

In [45]:
excel_file = pd.ExcelWriter('Baby_Names.xlsx')
excel_file

In [46]:
girls.to_excel(
    excel_writer = excel_file, sheet_name = 'Girls', index = False
)

In [47]:
boys.to_excel(
    excel_file,
    sheet_name = 'Boys',
    index = False,
    columns = ['nm', 'cnt', 'rnk']
)

In [48]:
excel_file.save()